1) /Users/tomek/projekty/private/dna/src/Genetics/Strand.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return strlen($this->dnaStrand);
     }
-    public function lengthEqual(Strand $otherStrand) : bool
+    protected function lengthEqual(Strand $otherStrand) : bool
     {
         return $this->length() === $otherStrand->length();
     }

2) /Users/tomek/projekty/private/dna/src/Genetics/Strand.php:23    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function lengthEqual(Strand $otherStrand) : bool
     {
-        return $this->length() === $otherStrand->length();
+        return $this->length() !== $otherStrand->length();
     }
     /**
      * @return array<string>

3) /Users/tomek/projekty/private/dna/src/Genetics/Strand.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return array<string>
      */
-    public function nucleotidesChars() : array
+    protected function nucleotidesChars() : array
     {
         return str_split($this->dnaStrand);
     }
